# Brewfile — snapshot reproduzível das ferramentas.
# Instalar:   brew bundle --file ~/.dotfiles/Brewfile
# Regenerar:  brew bundle dump --force --file ~/.dotfiles/Brewfile

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "asmvik/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"

# ── CLI / shell ───────────────────────────────────────────────────────────────
brew "neovim"
brew "tmux"
brew "skhd"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zoxide"
brew "bat"
brew "eza"
brew "jq"
brew "yq"
brew "tldr"
brew "btop"
brew "direnv"
brew "yazi"
brew "oh-my-posh"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ── Git ───────────────────────────────────────────────────────────────────────
brew "git"
brew "git-delta"
brew "lazygit"
brew "gh"
brew "lazydocker"

# ── Runtimes / build ──────────────────────────────────────────────────────────
brew "go"
brew "node@18"
brew "pnpm"
brew "yarn"
brew "python@3.14"
# python@3.11 is pinned for the Piper TTS venv (onnxruntime/piper-phonemize
# don't ship wheels for python@3.14 yet — see install.sh's Piper section)
brew "python@3.11"

# ── Projeto / diversos ────────────────────────────────────────────────────────
brew "awscli"
brew "infracost"
brew "mkcert"
brew "mysql-client"
brew "oath-toolkit"
brew "imagemagick"
brew "portaudio"
brew "chafa"
brew "viu"
brew "figlet"
brew "toilet"
brew "mpv"

# ── Casks (apps + fonte) ──────────────────────────────────────────────────────
cask "ghostty"
cask "docker-desktop"
cask "nikitabobko/tap/aerospace"
cask "font-jetbrains-mono-nerd-font"

# ── VS Code extensions ────────────────────────────────────────────────────────
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "joaoajmatos.tsoding-theme"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
